{
    "_name_or_path": "dandelin/vilt-b32-mlm",
    "architectures": [
      "ViltForQuestionAnswering"
    ],
    "attention_probs_dropout_prob": 0.0,
    "hidden_act": "gelu",
    "hidden_dropout_prob": 0.0,
    "hidden_size": 768,
    "id2label": {
      "0": "green",
      "1": "rectangular",
      "2": "two",
      "3": "ten",
      "4": "stone",
      "5": "square",
      "6": "stele",
      "7": "yes",
      "8": "three",
      "9": "seven",
      "10": "angular",
      "11": "three hundred and twentyfive",
      "12": "one",
      "13": "standing",
      "14": "five",
      "15": "pagoda",
      "16": "four",
      "17": "wood",
      "18": "blue",
      "19": "grey",
      "20": "brick",
      "21": "tile",
      "22": "semicircular",
      "23": "gray",
      "24": "1740",
      "25": "dragon",
      "26": "giltbronze",
      "27": "seated",
      "28": "mudra",
      "29": "serene",
      "30": "bronze",
      "31": "circular",
      "32": "twentyseven",
      "33": "hundreds",
      "34": "white",
      "35": "geometric patterns",
      "36": "thirteen",
      "37": "iron",
      "38": "vertical",
      "39": "red",
      "40": "clay",
      "41": "buddha",
      "42": "several",
      "43": "nine",
      "44": "octagonal",
      "45": "resting on knees",
      "46": "lotus petals",
      "47": "curved",
      "48": "dome",
      "49": "crosslegged",
      "50": "three hundred and thirtytwo",
      "51": "pointed",
      "52": "celadon",
      "53": "fishdragon",
      "54": "smooth",
      "55": "eight",
      "56": "girinshaped",
      "57": "willow",
      "58": "ceramic",
      "59": "brown",
      "60": "cloud and crane",
      "61": "vase",
      "62": "korean",
      "63": "paper",
      "64": "no",
      "65": "black",
      "66": "duck",
      "67": "water dropper",
      "68": "silver",
      "69": "incense burner",
      "70": "peaceful",
      "71": "gold",
      "72": "lotus flowers",
      "73": "crossed",
      "74": "abhaya mudra",
      "75": "pensive",
      "76": "rock",
      "77": "standing with hands in abhaya mudra",
      "78": "geometric",
      "79": "spiral pattern",
      "80": "earthenware",
      "81": "spear",
      "82": "raised",
      "83": "waterfowl",
      "84": "grape and monkey",
      "85": "underglaze iron",
      "86": "melonshaped",
      "87": "openwork auspiciouscharacter design",
      "88": "turtledragon",
      "89": "celadon green",
      "90": "cracked",
      "91": "lotus",
      "92": "scroll",
      "93": "peony",
      "94": "jar",
      "95": "grape",
      "96": "porcelain",
      "97": "thousand",
      "98": "calligraphy",
      "99": "elephant",
      "100": "hat",
      "101": "conical",
      "102": "peony and chrysanthemum",
      "103": "bowl",
      "104": "gourdshaped",
      "105": "seventh yeonga year",
      "106": "sshaped",
      "107": "oval",
      "108": "granite",
      "109": "urn",
      "110": "crown and jewelry",
      "111": "upright",
      "112": "lotus flower",
      "113": "numerous",
      "114": "underglaze copper",
      "115": "hats",
      "116": "painting",
      "117": "dragon finial",
      "118": "floral patterns",
      "119": "human figures",
      "120": "six",
      "121": "motherofpearl",
      "122": "floral",
      "123": "fine linear design",
      "124": "mountainous",
      "125": "demon face",
      "126": "deer",
      "127": "thirty",
      "128": "one hundred and twentynine",
      "129": "12000",
      "130": "jade",
      "131": "yellow",
      "132": "circle",
      "133": "1893",
      "134": "one hundred and ninety",
      "135": "many",
      "136": "dragon motif",
      "137": "raised in gesture",
      "138": "stern",
      "139": "plum and bamboo",
      "140": "ewer",
      "141": "bamboo",
      "142": "bottle",
      "143": "plum",
      "144": "round",
      "145": "phoenix",
      "146": "metal",
      "147": "crystal",
      "148": "transparent",
      "149": "lotus and scroll",
      "150": "pine and bamboo",
      "151": "cobalt blue",
      "152": "chrysanthemum",
      "153": "placenta",
      "154": "fish",
      "155": "flat",
      "156": "lotus and fish",
      "157": "earth tones",
      "158": "rough",
      "159": "winter",
      "160": "pine trees",
      "161": "oak",
      "162": "horse",
      "163": "spiral",
      "164": "geometric shapes",
      "165": "glass",
      "166": "circles ovals",
      "167": "long and slender",
      "168": "beige",
      "169": "eighty",
      "170": "archway",
      "171": "danseoksan mountain",
      "172": "arch",
      "173": "detailed",
      "174": "multiple",
      "175": "indigo",
      "176": "amoghapasha kalparaja sutra",
      "177": "sanskrit",
      "178": "heungwangsa",
      "179": "rain",
      "180": "trees",
      "181": "sharp peaks",
      "182": "river",
      "183": "agalmatolite",
      "184": "saddharmapundarika sutra",
      "185": "indigo paper",
      "186": "serious",
      "187": "silk",
      "188": "80000",
      "189": "palm leaves",
      "190": "crown",
      "191": "mountains rivers and cities",
      "192": "into provinces",
      "193": "ceramic tiles",
      "194": "hyomun",
      "195": "prunus",
      "196": "swirling",
      "197": "sgraffito",
      "198": "buncheong",
      "199": "landscape",
      "200": "stepped",
      "201": "monkeys",
      "202": "warrior",
      "203": "multieave",
      "204": "animals",
      "205": "rocky",
      "206": "cheon \u5929",
      "207": "carvings",
      "208": "grass and insect",
      "209": "vulture",
      "210": "over eighty",
      "211": "earthy tones",
      "212": "blue and red",
      "213": "rounded",
      "214": "sword",
      "215": "sloping",
      "216": "twentyfive",
      "217": "meditative",
      "218": "various",
      "219": "traditional hats",
      "220": "pagodalike",
      "221": "carvings of clouds and dragons",
      "222": "calm",
      "223": "gathered around table",
      "224": "twenty",
      "225": "votive offerings",
      "226": "various colors",
      "227": "seated in lotus position",
      "228": "long",
      "229": "loop"
    },
    "image_size": 384,
    "initializer_range": 0.02,
    "intermediate_size": 3072,
    "label2id": {
      "12000": 129,
      "1740": 24,
      "1893": 133,
      "80000": 188,
      "abhaya mudra": 74,
      "agalmatolite": 183,
      "amoghapasha kalparaja sutra": 176,
      "angular": 10,
      "animals": 204,
      "arch": 172,
      "archway": 170,
      "bamboo": 141,
      "beige": 168,
      "black": 65,
      "blue": 18,
      "blue and red": 212,
      "bottle": 142,
      "bowl": 103,
      "brick": 20,
      "bronze": 30,
      "brown": 59,
      "buddha": 41,
      "buncheong": 198,
      "calligraphy": 98,
      "calm": 222,
      "carvings": 207,
      "carvings of clouds and dragons": 221,
      "celadon": 52,
      "celadon green": 89,
      "ceramic": 58,
      "ceramic tiles": 193,
      "cheon \u5929": 206,
      "chrysanthemum": 152,
      "circle": 132,
      "circles ovals": 166,
      "circular": 31,
      "clay": 40,
      "cloud and crane": 60,
      "cobalt blue": 151,
      "conical": 101,
      "cracked": 90,
      "crossed": 73,
      "crosslegged": 49,
      "crown": 190,
      "crown and jewelry": 110,
      "crystal": 147,
      "curved": 47,
      "danseoksan mountain": 171,
      "deer": 126,
      "demon face": 125,
      "detailed": 173,
      "dome": 48,
      "dragon": 25,
      "dragon finial": 117,
      "dragon motif": 136,
      "duck": 66,
      "earth tones": 157,
      "earthenware": 80,
      "earthy tones": 211,
      "eight": 55,
      "eighty": 169,
      "elephant": 99,
      "ewer": 140,
      "fine linear design": 123,
      "fish": 154,
      "fishdragon": 53,
      "five": 14,
      "flat": 155,
      "floral": 122,
      "floral patterns": 118,
      "four": 16,
      "gathered around table": 223,
      "geometric": 78,
      "geometric patterns": 35,
      "geometric shapes": 164,
      "giltbronze": 26,
      "girinshaped": 56,
      "glass": 165,
      "gold": 71,
      "gourdshaped": 104,
      "granite": 108,
      "grape": 95,
      "grape and monkey": 84,
      "grass and insect": 208,
      "gray": 23,
      "green": 0,
      "grey": 19,
      "hat": 100,
      "hats": 115,
      "heungwangsa": 178,
      "horse": 162,
      "human figures": 119,
      "hundreds": 33,
      "hyomun": 194,
      "incense burner": 69,
      "indigo": 175,
      "indigo paper": 185,
      "into provinces": 192,
      "iron": 37,
      "jade": 130,
      "jar": 94,
      "korean": 62,
      "landscape": 199,
      "long": 228,
      "long and slender": 167,
      "loop": 229,
      "lotus": 91,
      "lotus and fish": 156,
      "lotus and scroll": 149,
      "lotus flower": 112,
      "lotus flowers": 72,
      "lotus petals": 46,
      "many": 135,
      "meditative": 217,
      "melonshaped": 86,
      "metal": 146,
      "monkeys": 201,
      "motherofpearl": 121,
      "mountainous": 124,
      "mountains rivers and cities": 191,
      "mudra": 28,
      "multieave": 203,
      "multiple": 174,
      "nine": 43,
      "no": 64,
      "numerous": 113,
      "oak": 161,
      "octagonal": 44,
      "one": 12,
      "one hundred and ninety": 134,
      "one hundred and twentynine": 128,
      "openwork auspiciouscharacter design": 87,
      "oval": 107,
      "over eighty": 210,
      "pagoda": 15,
      "pagodalike": 220,
      "painting": 116,
      "palm leaves": 189,
      "paper": 63,
      "peaceful": 70,
      "pensive": 75,
      "peony": 93,
      "peony and chrysanthemum": 102,
      "phoenix": 145,
      "pine and bamboo": 150,
      "pine trees": 160,
      "placenta": 153,
      "plum": 143,
      "plum and bamboo": 139,
      "pointed": 51,
      "porcelain": 96,
      "prunus": 195,
      "rain": 179,
      "raised": 82,
      "raised in gesture": 137,
      "rectangular": 1,
      "red": 39,
      "resting on knees": 45,
      "river": 182,
      "rock": 76,
      "rocky": 205,
      "rough": 158,
      "round": 144,
      "rounded": 213,
      "saddharmapundarika sutra": 184,
      "sanskrit": 177,
      "scroll": 92,
      "seated": 27,
      "seated in lotus position": 227,
      "semicircular": 22,
      "serene": 29,
      "serious": 186,
      "seven": 9,
      "seventh yeonga year": 105,
      "several": 42,
      "sgraffito": 197,
      "sharp peaks": 181,
      "silk": 187,
      "silver": 68,
      "six": 120,
      "sloping": 215,
      "smooth": 54,
      "spear": 81,
      "spiral": 163,
      "spiral pattern": 79,
      "square": 5,
      "sshaped": 106,
      "standing": 13,
      "standing with hands in abhaya mudra": 77,
      "stele": 6,
      "stepped": 200,
      "stern": 138,
      "stone": 4,
      "swirling": 196,
      "sword": 214,
      "ten": 3,
      "thirteen": 36,
      "thirty": 127,
      "thousand": 97,
      "three": 8,
      "three hundred and thirtytwo": 50,
      "three hundred and twentyfive": 11,
      "tile": 21,
      "traditional hats": 219,
      "transparent": 148,
      "trees": 180,
      "turtledragon": 88,
      "twenty": 224,
      "twentyfive": 216,
      "twentyseven": 32,
      "two": 2,
      "underglaze copper": 114,
      "underglaze iron": 85,
      "upright": 111,
      "urn": 109,
      "various": 218,
      "various colors": 226,
      "vase": 61,
      "vertical": 38,
      "votive offerings": 225,
      "vulture": 209,
      "warrior": 202,
      "water dropper": 67,
      "waterfowl": 83,
      "white": 34,
      "willow": 57,
      "winter": 159,
      "wood": 17,
      "yellow": 131,
      "yes": 7
    },
    "layer_norm_eps": 1e-12,
    "max_image_length": -1,
    "max_position_embeddings": 40,
    "modality_type_vocab_size": 2,
    "model_type": "vilt",
    "num_attention_heads": 12,
    "num_channels": 3,
    "num_hidden_layers": 12,
    "num_images": -1,
    "patch_size": 32,
    "qkv_bias": true,
    "tie_word_embeddings": false,
    "torch_dtype": "float32",
    "transformers_version": "4.46.3",
    "type_vocab_size": 2,
    "vocab_size": 30522
  }
  